Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/registration_of_non_eea_nationals_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Registration of non-EEA nationals
ga: Clárú náisiúnach neamh-LEE in Éirinn

source: If you are not a citizen of the European Economic Area (EEA) or Switzerland, you need permission to enter Ireland
ga: Mura shaoránach tú den Limistéar Eorpach Eacnamaíoch (LEE) nó an Eilvéis, ní mór duit cead isteach in Éirinn a fháil

source: If you wish to stay for more than 3 months you must have permission to remain and register your presence in Ireland with immigration
ga: Más mian leat fanacht anseo níos mó ná 3 mhí, caithfidh tú cead fanachta a bheith agat agus ní mór duit do láithreacht in Éirinn a chlárú leis inimirce

source: Under Section 9 of the Immigration Act 2004, non-EEA nationals must register when staying here for more than 3 months
ga: Leagann amach Alt 9 den Acht Inimirce an ceanglas dlíthiúil atá ar náisiúnaigh neamh-LEE clárú in Éirinn nuair atá siad ag fanacht níos mó ná 3mhí

source: In practice, this means that you are obliged to register with your local immigration registration officer following your arrival in Ireland
ga: Le fírinne, ciallaíonn sé seo go bhfuil sé de dhualgas ort clárú le d'oifig clárúcháin áitiúil um inimirce tar éis teacht go hÉirinn duit

source: Registering with immigration officials means appearing in person before the registration officer and providing certain information and evidence about your status - see 'How to apply' below
ga: Séard is brí le clárú le feidhmeannaigh um inimirce ná go gcaithfidh tú féin a bheith i láthair agus tú ag dul os chomhair an oifigigh chlárúcháin agus eolas áirithe agus fianaise faoi do stádas a sholáthar - féach 'Conas iarratas a dhéanamh' thíos

source: Any changes you wish to make to the length of your stay or status must also be reported to immigration officials
ga: Caithfidh tú freisin aon athruithe gur mhian a dhéanamh, maidir led' thréimhse chónaithe nó stádas, a chur in iúl do na feidhmeannaigh inimirce

source: You must also notify the registration officer if you plan to move to another Garda District, and report to the registration officer of that new district within 2 days of arriving to live there
ga: Má tá sé ar intinn agat bogadh go ceantar Garda Síochána eile caithfidh tú é sin a chur in iúl don oifigeach clárúcháin, agus teagmháil a dhéanamh leis an oifigeach clárúcháin sa cheantar nua sin taobh istigh de dhá lá tar éis teacht chun cónaí ann

source: What is the purpose of registration?
ga: Cad í aidhm an chlárúcháin?

source: The purpose of registration of non-EEA nationals is for border control reasons
ga: Rialú teorann is cúis le clárú náisiúnach neamh-LEE

source: The Garda National Immigration Bureau (GNIB) also carries out deportations, border control and investigations related to illegal immigration and trafficking in human beings
ga: Cuireann an Biúró Náisiúnta an Gharda Síochána um Inimirce (BNGSI) díbirtí, rialú teorann agus fiosrúcháin maidir le inimirce mídhleathach agus gáinneáil i ndaoine i bhfeidhm freisin

source: The GNIB has specialist units dealing in each area
ga: Tá sainaonaid ag an mBNGSI i mbun oibre i ngach ceantar

source: What happens after I register?
ga: Cad a tharlaíonn tar éis clárú dom?

source: Following registration with immigration officials, you will be issued with a Certificate of Registration
ga: Tar éis clárú leis na feidhmeannaigh inimirce, tabharfar Teastas Clárúcháin um Inimirce duit

source: The Certificate is the size of a credit card and includes your name, address, photograph and your residence details
ga: Tá an Teastas Clárúcháin ar chomhmhéid le cárta creidmheasa agus d'ainm, seoladh, grianghraf agus do shonraí cónaithe ann

source: It is often called a GNIB card
ga: Tugtar an Cárta BNGSI air uaireanta

source: Asylum seekers receive a different type of certificate – a Temporary Residence Certificate which is issued by the International Protection Office
ga: Faigheann iarrthóirí tearmainn teastas de shaghas eile - Teastas Cónaithe Sealadach. Eisíonn an Oifig um Chosaint Idirnáisiúnta an teastas sin

source: Certificates of Registration are not identity cards
ga: Ní cártaí aitheantais iad na Teastais Chlárúcháin

source: They are, however, evidence that a person is legally resident in Ireland and you must show evidence of this, if requested by the Gardaí
ga: Mar sin féin is fianaise iad go bhfuil an duine ina c(h)ónaí go dlíthiúil in Éirinn agus caithfidh tú fianaise faoi seo a thaispeáint, mar iarrtar í ó na Gardaí

source: As well as your Certificate of Registration you will also receive a stamp in your passport which specifies the duration and the conditions of your permission to remain in Ireland
ga: Chomh maith le do Theastas Clárúcháin gheobhaidh tú stampa freisin i do phas a shonraíonn tréimhse agus coinníollacha do chead fanacht in Éirinn

source: The following table gives a list of the different types of stamp issued to non-EEA nationals:
ga: Tugann an tábla seo leanas liosta de na cineálacha stampa difriúil eisithe do náisiúnaigh neamh-LEE:

source: │0 │Persons who are permitted to remain in Ireland for a specific, temporary and limited │
ga: │0 │Dhaoine a bhfuil cead acu fanacht in Éirinn chun chríoch sonrach, sealadach agus │

source: │ │purpose, for example, visiting academics; retired people of independent means; │
ga: │ │teoranta, mar shampla, acadóra ar cuairt; daoine ar scor le hacmhainní neamhspleácha.│

source: │1 │Persons who have received an employment permit, business permission or a working │
ga: │1 │Dhaoine go bhfuil cead fostaíochta, cead gnó nó údarú saoire oibre faighte acu │

source: │1G │Graduates who are permitted to remain under the Third Level Graduate Scheme (pdf). │
ga: │1A │Céimithe a bhfuil cead fanacht acu faoin Scéim Céimnithe Tríú Leibhéal (pdf) │

source: │2 │Students who are attending a recognised full-time course of at least one year
ga: │ │Mic léinn atá ag freastail ar chúrsa aitheanta lán-aimsire a mhaireann ar feadh │

source: │ │permitted to work for 20 hours a week during term time and full time during holidays
ga: Tá cead acu dul ag obair 20 uair sa tseachtain le linn téarma │ │ │scoile agus go lánaimseartha i rith na laethanta saoire

source: │2A │Students who are attending a course not recognised by the Department of Education and │
ga: │2A │Mhic léinn atá ag freastail ar chúrsa a mhaireann níos lú ná bliain amháin

source: They are not permitted to work. │
ga: │ │acu dul ag obair │

source: │ │Persons who are not permitted to work
ga: │3 │Dhaoine nach bhfuil cead acu dul ag obair

source: This includes visitors; ministers of religion │
ga: Cuimsíonn sé seo cuairteoirí; ministir │

source: │3 │and members of religious orders; spouses, civil partners and dependants of employment │ │ │permit holders
ga: │ │reiligiúin; céilí, páirtnéirí sibhialta agus cleithiúnaithe shealbhóirí ceadanna

source: │ │Spouses and civil partners of Irish nationals; family members of EEA citizens; people │
ga: │ │Chéilí, páirtnéirí sibhialta agus cleithiúnaithe náisiúnach Éireannach agus │

source: │4 │granted international protection (refugee status or subsidiary protection); parents of │
ga: │4 │náisiúnach LEE, daoine a bhronnadh cosaint idirnáisiúnta (stáideas dídeanaí nó │

source: │ │Irish citizen child granted permission to remain on that basis
ga: │ │cosaint choimhdeach) dóibh, agus tuismitheoirí leanaí saoránach Éireannach a thugadh │

source: │ │employment permit or business permission to work. │
ga: Is féidir leo dul ag obair gan cheadúnas fostaíochta nó cead gnó.│

source: │4 (EU │Family members of EU nationals who have exercised their right to move to and live in │
ga: │4 (EU │Baill teaghlaigh náisiúnach an AE a bhain leas as a gceart bogadh agus cur fúthu in │

source: They do not need an employment permit or business permission to work
ga: Is féidir leo dul ag obair gan chead fostaíochta nó cead gnó │

source: There is a fee of €300 for each Certificate of Registration issued to a non-EEA national
ga: Tá táille €300 ann do gach Teastas Clárúcháin eisithe do náisiúnach neamh-LEE

source: This fee is also payable when you are renewing it or replacing it if lost or stolen
ga: Má dhéanann tú athnuachan ar do theastas nó má athchuireann tú teastas caillte nó goidte, ní mór duit an táille a íoc

source: You do not have to pay a fee if you are:
ga: Ní gá duit íoc as más:

source: • A person who has been reunified with such a refugee under sections 56 and 57 of the International Protection Act 2015
ga: • Duine athaontaithe lena leithéid de dhídeanaí faoi Alt 56 agus 57 den Acht um Chosaint Idirnáisiúnta 2015

source: • The spouse, civil partner, widow, widower or surviving civil partner of an Irish citizen
ga: • Faoi 18 mbliana d'aois ag am an chlárúcháin tú • Céile, páirtnéir sibhialta, baintreach, baintreach fir nó páirtnéir sibhialta marthanach de shaoránach Éireannach tú

source: • A family member of an EU national and you are given a residence card under EU Treaty Rights
ga: • Cleithiúnach de náisiúnach an AE tú agus cáilíonn tú do chárta cónaithe faoi Threoir ón AE 38/04 (pdf) tú

source: You can read more information about fees and payment methods on inis.gov.ie
ga: Léigh tuilleadh faoi tháillí agus faoi mhodhanna íocaíochta ar inis.gov.ie

source: As soon as possible following your arrival in Ireland, you should go to your local immigration registration office. If you live in Dublin this is the Burgh Quay Registration Office
ga: Buail isteach chuig d'oifig chlárúcháin inimirce áitiúil 'sé sin an Oifig Chlárúcháin Cé an Bhúrcaigh más i mBaile Átha Cliath atá cónaí ort

source: Since 15 September 2016, you must book an appointment online to visit it
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: If you live outside Dublin, you go to your local registration office either a regional registration office or at your Garda District Headquarters – see 'Where to apply' below
ga: Má tá cónaí ort lasmuigh de Bhaile Átha Cliath, ba chóir duit dul go dtí d'oifig chlárúcháin inimirce áitiúil, mar oifig chlárúcháin régiúnach nó an Ceanncheathrú Ceantair an Gharda Síochána - féach 'Cá háit a ndéanfaidh mé iarratas thíos'

source: You should bring your passport or other document establishing your nationality and identity and you should provide any information requested in connection with the purpose of your arrival in Ireland
ga: Ba chóir duit do phas nó doiciméad eile ag bunú do náisiúntacht agus d' fhéiniúlacht a thabhairt leat agus aon eolas iarrtha maidir le cúis do theacht in Éirinn a sholáthar

source: You should also bring documentation supporting your residence permission
ga: Chomh maith ba chóir duit doiciméad mar thacaíocht do do chead fanacht, mar shampla, cead fostaíochta a thabhairt leat

source: The registration officer will take your details and check your documents
ga: Tógfaidh an t-oifigeach clárúcháin do shonraí agus scrúdóidh sé do dhoiciméid

source: The registration officer may also ask you to provide fingerprints, and may ask for further details
ga: D'fhéadfadh go n-iarrfaidh an t-oifigeach clárúcháin leat méarloirg agus sonraí eile a sholáthair

source: Before your Certificate of Registration expires you should go to your local immigration registration office to renew it
ga: Sula mbíonn do Theastas Clárúcháin imithe in éag, caithfidh tú dul go dtí d'oifig clárúcháin áitiúil um inimirce chun é a athnuachan

source: You will need to bring your passport, your Certificate of Registration and evidence to support your residence permission such an employment permit
ga: Tá sé ort do phas, do chárta BNGSI a thabhairt leat chomh maith le doiciméad mar thacaíocht do do chead fanacht, mar shampla, cead oibre

source: If you lose your Certificate of Registration or if it is stolen, you should report the loss or theft to the nearest Garda station and get a lost/stolen report
ga: Má chailleann tú do Theastas Clárúcháin nó má tá sé goidte, ba chóir duit an ghoid a thuairisciú don stáisiún na nGardaí is gaire duit agus tuairisc caillte/goidte a fháil

source: If you are abroad you should report it to the nearest police station and get a similar report
ga: Má tá tú thar lear, ba chóir duit an goid a thuairisciú don stáisiún na bpóilíní is gaire duit agus tuairisc comhcosúil a fháil

source: You should then go to your local immigration registration office with the lost/stolen report and your passport to get a replacement Certificate of Registration. Where to apply
ga: Ansin, ba chóir duit an tuairisc caillte/goidte agus do phas a thabhairt chuig d'oifig clárúcháin áitiúil um inimirce chun Teastas Clárúcháin athsholáthair a fháil
